In [1]:
import pandas as pd

In [2]:
casts = pd.read_csv('cast.csv')

In [3]:
casts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75001 entries, 0 to 75000
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   title      75000 non-null  object
 1   year       75001 non-null  int64
 2   name       75001 non-null  object
 3   type       75001 non-null  object
 4   character  75001 non-null  object
 5   n          46035 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 3.4+ MB

In [5]:
casts.head(3)

                 title  year      name   type        character     n
0       Closet Monster  2015  Buffy #1  actor          Buffy 4  31.0
1      Suuri illusioni  1985    Homo $  actor           Guests  22.0
2  Battle of the Sexes  2017   $hutter  actor  Bobby Riggs Fan  10.0

In [6]:
casts.tail(3)

,title,year,name,type,character,n
74998,Festival of Lights,2010,Zoe Anastassiou,actress,Guidance Counselor,20.0
74999,Toxic Tutu,2016,Zoe Anastassiou,actress,Demon of Toxicity,NaN
75000,Fugitive Pieces,2007,Anastassia Anastassopoulou,actress,Laundry Girl,25.0

In [7]:
titles = pd.read_csv('titles.csv')

In [8]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   title   50000 non-null  object
 1   year    50000 non-null  int64
dtypes: int64(1), object(1)
memory usage: 781.4+ KB

In [10]:
titles.head(2)
titles.tail(2)

                      title  year
49998  Aao Jao Ghar Tumhara  1984
49999            Mrs. Munck  1995

In [11]:
titles

                         title  year
0               The Rising Son  1990
1      The Thousand Plane Raid  1969
2             Crucea de piatra  1993
3                      Country  2000
4                   Gaiking II  2011
...                        ...   ...
49995                    Rebel  1970
49996                  Suzanne  1996
49997                    Bomba  2013
49998     Aao Jao Ghar Tumhara  1984
49999               Mrs. Munck  1995

[50000 rows x 2 columns]

In [13]:
## 1번 : 2000이후 개봉한 영화
titles[titles['year'] > 2000]

                                title  year
4                          Gaiking II  2011
5                         Medusa (IV)  2015
6      The Fresh Air Will Do You Good  2008
8                          L'outsider  2016
9              Do Outro Lado do Mundo  2008
...                               ...   ...
49984          No quiero ser recuerdo  2014
49989                         Vincere  2009
49990                         Junebug  2005
49993                  Corruption.Gov  2010
49997                           Bomba  2013

[22498 rows x 2 columns]

In [15]:
after2000 = titles[titles.year > 2000]

In [16]:
after2000.head(2)

         title  year
4   Gaiking II  2011
5  Medusa (IV)  2015

In [ ]:
## 2번 : 2000년 ~ 2009년 개봉

In [19]:
movie2000 = titles[(titles.year >= 2000) & (titles.year <= 2009)]

In [20]:
movie2000

                                title  year
3                             Country  2000
6      The Fresh Air Will Do You Good  2008
9              Do Outro Lado do Mundo  2008
15                         Panic Room  2002
21                     Passenger Side  2009
...                               ...   ...
49948                            Kuka  2007
49971              Dei gau tin cheung  2001
49980                 Tocatta & Fugue  2007
49989                         Vincere  2009
49990                         Junebug  2005

[8330 rows x 2 columns]

In [21]:
movie2000.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8330 entries, 3 to 49990
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   title   8330 non-null   object
 1   year    8330 non-null   int64
dtypes: int64(1), object(1)
memory usage: 195.2+ KB

In [22]:
titles[titles['year'] // 10 == 200]

                                title  year
3                             Country  2000
6      The Fresh Air Will Do You Good  2008
9              Do Outro Lado do Mundo  2008
15                         Panic Room  2002
21                     Passenger Side  2009
...                               ...   ...
49948                            Kuka  2007
49971              Dei gau tin cheung  2001
49980                 Tocatta & Fugue  2007
49989                         Vincere  2009
49990                         Junebug  2005

[8330 rows x 2 columns]

In [23]:
# 3번 영화제목 Macbeth 
macbeth = titles[titles['title'] == 'Macbeth']

In [24]:
macbeth

         title  year
4226   Macbeth  1913
9322   Macbeth  2006
11722  Macbeth  2013
17166  Macbeth  1997
25847  Macbeth  1998

In [28]:
# 4번 연도순으로 정렬 (확인 필요!)
macbeth_ordered = macbeth.sort_values('year')

In [29]:
# 5번 : 맥베스 오더내림차순 정렬
macbeth_ordered.sort_values('year', ascending=False)

         title  year
11722  Macbeth  2013
9322   Macbeth  2006
25847  Macbeth  1998
17166  Macbeth  1997
4226   Macbeth  1913

In [34]:
# 6번 movie2000를  연도별 정렬 제목정렬
movie2000.sort_values('year').sort_values('title') # X
movie2000.sort_values(['year','title'])

                             title  year
15011                        $pent  2000
33708  (I'm Living) A Charmed Life  2000
47278                    100 Girls  2000
13551                   12 O'clock  2000
39679             2000 + 1 stigmes  2000
...                            ...   ...
17521                 Zombie Punch  2009
28159    Zombie Werewolves Attack!  2009
37473                   Zombieland  2009
3878                  Zooey & Adam  2009
25646                   homo gamer  2009

[8330 rows x 2 columns]